feijie825/TM4C-gonghao/TM4C123BootLoader/inc/TM4C123_Lib.h
/******************** (C) COPYRIGHT 2014 TI TM4C123 ********************
;* File Name          : TM4C123_Lib.h
;* Author             : 张力阵
;* 函数库声明预定义
*******************************************************************************/

//#include "tm4c123bh6pge.h"
#include <stdbool.h>
#include "Data_types.h"
#include "adc.h"
#include "asmdefs.h"
#include "can.h"
#include "comp.h"
#include "cpu.h"
#include "debug.h"
#include "eeprom.h"
#include "flash.h"
#include "fpu.h"
#include "gpio.h"
#include "hibernate.h"
#include "i2c.h"
#include "interrupt.h"
#include "mpu.h"
#include "pin_map.h"
#include "pwm.h"
#include "qei.h"
#include "rom.h"
#include "rom_map.h"
#include "rtos_bindings.h"
#include "ssi.h"
#include "sysctl.h"
#include "sysexc.h"
#include "systick.h"
#include "timer.h"
#include "uart.h"
#include "udma.h"
#include "usb.h"
#include "watchdog.h"
#include "hw_adc.h"
#include "hw_aes.h"
#include "hw_can.h"
#include "hw_ccm.h"
#include "hw_comp.h"
#include "hw_des.h"
#include "hw_eeprom.h"
#include "hw_emac.h"
#include "hw_epi.h"
#include "hw_fan.h"
#include "hw_flash.h"
#include "hw_gpio.h"
#include "hw_hibernate.h"
#include "hw_i2c.h"
#include "hw_ints.h"
#include "hw_lcd.h"
#include "hw_lpc.h"
#include "hw_memmap.h"
#include "hw_nvic.h"
#include "hw_peci.h"
#include "hw_pwm.h"
#include "hw_qei.h"
#include "hw_shamd5.h"
#include "hw_ssi.h"
#include "hw_sysctl.h"
#include "hw_sysexc.h"
#include "hw_timer.h"
#include "hw_types.h"
#include "hw_uart.h"
#include "hw_udma.h"
#include "hw_usb.h"
#include "hw_watchdog.h"
